tap "argoproj/tap"
tap "bradschwartz/tap", "https://github.com/bradschwartz/homebrew-tap.git"
tap "cue-lang/tap"
tap "dagger/tap"
tap "gemfury/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "warrensbox/tap"
# Run your GitHub Actions locally 🚀
brew "act"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Bash Automated Testing System
brew "bats-core"
# Object-file caching compiler wrapper
brew "ccache"
# Cross-platform make
brew "cmake"
# Documentation for CMake
brew "cmake-docs"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Message bus system, providing inter-application communication
brew "dbus"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Distributed compiler client and server
brew "distcc"
# Tool for exploring each layer in a docker image
brew "dive"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr"
# Simple command-line tool for creating clusters on Amazon EKS
brew "eksctl"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# GNU Emacs text editor
brew "emacs", restart_service: true
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line tools for fly.io services
brew "flyctl"
# Geometry Engine
brew "geos"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Tool Command Language
brew "tcl-tk"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# Git extension for versioning large files
brew "git-lfs"
# Easy semantic versioning for projects using Git
brew "gitversion"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Development kit for the Java programming language
brew "openjdk"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Make JSON greppable
brew "gron"
# Java-based scripting language
brew "groovy"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Kubernetes package manager
brew "helm"
# System/370, ESA/390 and z/Architecture Emulator
brew "hercules"
# Apache HTTP server
brew "httpd"
# Command-line benchmarking tool
brew "hyperfine"
# GNU utilities for networking
brew "inetutils"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Quantify abundances of transcripts from RNA-Seq data
brew "kallisto"
# Run local Kubernetes cluster in Docker
brew "kind"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Add indentation to LaTeX files
brew "latexindent"
# Next-gen compiler infrastructure
brew "llvm"
# Java-based project management
brew "maven"
# Bash completion for Maven
brew "maven-completion"
# Run a Kubernetes cluster locally
brew "minikube"
# Modern Linker
brew "mold"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql"
# NCurses Disk Usage
brew "ncdu"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Open source, general-purpose policy engine
brew "opa"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Python dependency management tool
brew "pipenv"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Object-relational database system
brew "postgresql@13"
# Object-relational database system
brew "postgresql@14"
# Beautiful and useful low-latency prompt for your shell
brew "powerline-go"
# Go support for Google's protocol buffers
brew "protoc-gen-go"
# Protoc plugin that generates code for gRPC-Go clients
brew "protoc-gen-go-grpc"
# Show ps output as a tree
brew "pstree"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Command-line YAML and XML processor that wraps jq
brew "python-yq"
# Software environment for statistical computing
brew "r"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Rust toolchain installer
brew "rustup-init"
# JVM-based programming language
brew "scala"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Modern SSH server for teams managing distributed infrastructure
brew "teleport"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# Internet file retriever
brew "wget"
# Kubectl Argo Rollouts Plugin.
brew "argoproj/tap/kubectl-argo-rollouts"
# Subcommands for git
brew "bradschwartz/tap/git-subcommands"
# CUE is an open source data constraint language which aims to simplify tasks involving defining and using data.
brew "cue-lang/tap/cue"
# Dagger is a programmable deployment system.
brew "dagger/tap/dagger"
# Hosted repo for your public and private packages
brew "gemfury/tap/gemfury"
# Boundary
brew "hashicorp/tap/boundary"
# Consul
brew "hashicorp/tap/consul"
# The tfswitch command lets you switch between terraform versions.
brew "warrensbox/tap/tfswitch"
# JDK from the Java User Group (JUG)
cask "adoptopenjdk"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Draw.io is free online diagram software
cask "drawio"
cask "font-inconsolata-for-powerline"
# Sans-serif, slab-serif, monospace and quasi‑proportional typeface family
cask "font-iosevka"
cask "font-menlo-for-powerline"
# Web browser
cask "google-chrome"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Mesh VPN based on Wireguard
cask "tailscale"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin8"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
