tap "argoproj/tap"
tap "bradschwartz/tap", "https://github.com/bradschwartz/homebrew-tap.git"
tap "cue-lang/tap"
tap "d12frosted/emacs-plus"
tap "dagger/tap"
tap "derailed/k9s"
tap "garden-io/garden"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "johanhaleby/kubetail"
tap "metalbear-co/mirrord"
tap "oven-sh/bun"
tap "sourcegraph/src-cli"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Generic library support script
brew "libtool"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Spell checker with better logic than ispell
brew "aspell"
# Command-line interface for SQLite
brew "sqlite"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Cross-platform make
brew "cmake"
# Emulator for x86 and PowerPC
brew "qemu", args: ["HEAD"]
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Message bus system, providing inter-application communication
brew "dbus"
# Reference implementation for the Development Containers specification
brew "devcontainer"
# Tool for exploring each layer in a docker image
brew "dive"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# GNU Emacs text editor
brew "emacs"
# Command-line tool to interact with exercism.io
brew "exercism"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line tools for fly.io services
brew "flyctl"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Tool Command Language
brew "tcl-tk"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# Git extension for versioning large files
brew "git-lfs"
# Open-source GitLab command-line tool
brew "glab"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Development kit for the Java programming language
brew "openjdk"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Java-based scripting language
brew "groovy"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Improved top (interactive process viewer)
brew "htop"
# Apache HTTP server
brew "httpd"
# Command-line benchmarking tool
brew "hyperfine"
# GNU utilities for networking
brew "inetutils"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# SDK for building Kubernetes APIs using CRDs
brew "kubebuilder"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Report faked system time to programs
brew "libfaketime"
# Utility for directing compilation
brew "make"
# Java-based project management
brew "maven"
# Bash completion for Maven
brew "maven-completion"
# Elixir Mix completion plus shortcuts/colors
brew "mix-completion"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Open source, general-purpose policy engine
brew "opa"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# SDK for building Kubernetes applications
brew "operator-sdk"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Python dependency management tool
brew "pipenv"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Manage compile and link flags for libraries
brew "pkg-config"
# Object-relational database system
brew "postgresql@13"
# Object-relational database system
brew "postgresql@14"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Show ps output as a tree
brew "pstree"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Command-line YAML and XML processor that wraps jq
brew "python-yq"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Rust toolchain installer
brew "rustup-init"
# Login and retrieve AWS temporary credentials using a SAML IDP
brew "saml2aws"
# Database of common MIME types
brew "shared-mime-info"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# Subcommands for git
brew "bradschwartz/tap/git-subcommands"
# Dagger is an integrated platform to orchestrate the delivery of applications
brew "dagger/tap/dagger"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Development engine for Kubernetes
brew "garden-io/garden/garden-cli"
# Boundary
brew "hashicorp/tap/boundary"
# Terraform Language Server
brew "hashicorp/tap/terraform-ls"
# Tail logs from multiple Kubernetes pods at the same time
brew "johanhaleby/kubetail/kubetail"
# Connect your local process and your cloud environment
brew "metalbear-co/mirrord/mirrord"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Sourcegraph CLI
brew "sourcegraph/src-cli/src-cli"
# JDK from the Java User Group (JUG)
cask "adoptopenjdk"
# Voice and text chat software
cask "discord"
cask "font-inconsolata-for-powerline"
# Sans-serif, slab-serif, monospace and quasi‑proportional typeface family
cask "font-iosevka"
cask "font-menlo-for-powerline"
# Apple's SF Mono font patched with the Nerd Fonts patcher for Powerline support
cask "font-sf-mono-for-powerline"
# Open-source platform for visualizing and manipulating large graphs
cask "gephi"
# HTTP and GraphQL Client
cask "insomnia"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Code notebooks for Elixir developers
cask "livebook"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Collaboration platform for API development
cask "postman"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Video game digital distribution service
cask "steam"
# Mesh VPN based on Wireguard
cask "tailscale"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin8"
# Open-source code editor
cask "visual-studio-code"
vscode "bierner.comment-tagged-templates"
vscode "bierner.markdown-mermaid"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "github.vscode-github-actions"
vscode "GitLab.gitlab-workflow"
vscode "golang.go"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "JakeBecker.elixir-ls"
vscode "jasonnutter.vscode-codeowners"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "Shopify.ruby-lsp"
vscode "sourcegraph.cody-ai"
vscode "sourcegraph.sourcegraph"
vscode "tsandall.opa"
vscode "unifiedjs.vscode-mdx"
vscode "vadimcn.vscode-lldb"
vscode "william-voyek.vscode-nginx"
vscode "xaver.clang-format"
