tap "argoproj/tap"
tap "bradschwartz/tap", "https://github.com/bradschwartz/homebrew-tap.git"
tap "cue-lang/tap"
tap "d12frosted/emacs-plus"
tap "dagger/tap"
tap "derailed/k9s"
tap "garden-io/garden"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "johanhaleby/kubetail"
tap "launchdarkly/tap"
tap "metalbear-co/mirrord"
tap "oven-sh/bun"
tap "sourcegraph/src-cli"
tap "synchronal/tap"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Distributed revision control system
brew "git"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Spell checker with better logic than ispell
brew "aspell"
# Automatic configure script builder
brew "autoconf"
# Command-line interface for SQLite
brew "sqlite"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# C library implementing the SSH2 protocol
brew "libssh2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Cross-platform make
brew "cmake"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Message bus system, providing inter-application communication
brew "dbus"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Reference implementation for the Development Containers specification
brew "devcontainer"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr"
# Text processing system for reStructuredText
brew "docutils"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Language Server and Debugger for Elixir
brew "elixir-ls"
# Asynchronous event library
brew "libevent"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Emacs text editor
brew "emacs"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# LLVM bytecode to JavaScript compiler
brew "emscripten"
# Command-line tool to interact with exercism.io
brew "exercism"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line tools for fly.io services
brew "flyctl"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Tool Command Language
brew "tcl-tk"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# Git extension for versioning large files
brew "git-lfs"
# Open-source GitLab command-line tool
brew "glab"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Java-based scripting language
brew "groovy"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# System/370, ESA/390 and z/Architecture Emulator
brew "hercules"
# Improved top (interactive process viewer)
brew "htop"
# Apache HTTP server
brew "httpd"
# Command-line benchmarking tool
brew "hyperfine"
# Database of common MIME types
brew "shared-mime-info"
# GNU utilities for networking
brew "inetutils"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Open-source distributed event streaming platform
brew "kafka"
# Network authentication protocol
brew "krb5"
# SDK for building Kubernetes APIs using CRDs
brew "kubebuilder"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Build tool for sending feature flag code references to LaunchDarkly
brew "ld-find-code-refs"
# Report faked system time to programs
brew "libfaketime"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# JIT library for the GNU compiler collection
brew "libgccjit"
# Scalable user load testing tool written in Python
brew "locust"
# Java-based project management
brew "maven"
# Bash completion for Maven
brew "maven-completion"
# Elixir Mix completion plus shortcuts/colors
brew "mix-completion"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Open source, general-purpose policy engine
brew "opa"
# Open source suite of directory software
brew "openldap"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# SDK for building Kubernetes applications
brew "operator-sdk"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Python dependency management tool
brew "pipenv"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Object-relational database system
brew "postgresql@13"
# Object-relational database system
brew "postgresql@14"
# Show ps output as a tree
brew "pstree"
# Command-line YAML and XML processor that wraps jq
brew "python-yq", link: false
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Generic machine emulator and virtualizer
brew "qemu"
# Erlang build tool
brew "rebar3"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Rust toolchain installer
brew "rustup"
# Login and retrieve AWS temporary credentials using a SAML IDP
brew "saml2aws"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Terraform Language Server
brew "terraform-ls"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Creates fully functional virtual k8s cluster inside host k8s cluster's namespace
brew "vcluster"
# Disaster recovery for Kubernetes resources and persistent volumes
brew "velero"
# Simple terminal image viewer written in Rust
brew "viu"
# Command-line client for WebSockets
brew "websocat"
# WebSockets the Unix way
brew "websocketd"
# Internet file retriever
brew "wget"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Linter for YAML files
brew "yamllint"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Kubectl Argo Rollouts Plugin.
brew "argoproj/tap/kubectl-argo-rollouts"
# Subcommands for git
brew "bradschwartz/tap/git-subcommands"
# GNU Emacs text editor
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-dbus", "with-imagemagick"], link: false
# Dagger is an integrated platform to orchestrate the delivery of applications
brew "dagger/tap/dagger"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Boundary
brew "hashicorp/tap/boundary"
# Vault
brew "hashicorp/tap/vault"
# Tail logs from multiple Kubernetes pods at the same time
brew "johanhaleby/kubetail/kubetail"
# Connect your local process and your cloud environment
brew "metalbear-co/mirrord/mirrord"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Sourcegraph CLI
brew "sourcegraph/src-cli/src-cli"
# Daily Diff
brew "synchronal/tap/dyd"
# JDK from the Java User Group (JUG)
cask "adoptopenjdk"
# Tools for building Android applications
cask "android-studio"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# E-books management software
cask "calibre"
# Terminal-based AI coding assistant
cask "claude-code"
# Write, edit, and chat about your code with AI
cask "cursor"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
cask "font-inconsolata-for-powerline"
cask "font-iosevka"
cask "font-menlo-for-powerline"
cask "font-sf-mono-for-powerline"
# Open-source platform for visualizing and manipulating large graphs
cask "gephi"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Vector graphics editor
cask "inkscape"
# HTTP and GraphQL Client
cask "insomnia"
# IDE for Java development - community edition
cask "intellij-idea-ce"
# Code notebooks for Elixir developers
cask "livebook"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# VPN client
cask "mullvad-vpn"
# Client-side GUI application for modern database development and operations
cask "nosql-workbench"
# App to write, plan, collaborate, and get organised
cask "notion"
# Identity verification provider
cask "okta-verify"
# Collaboration platform for API development
cask "postman"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Video game digital distribution service
cask "steam"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@8"
# Open-source code editor
cask "visual-studio-code"
# View output from scripts in the menu bar
cask "xbar"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
vscode "bierner.comment-tagged-templates"
vscode "bierner.markdown-mermaid"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "expert-lsp.expert"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "gitlab.gitlab-workflow"
vscode "gleam.gleam"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "jakebecker.elixir-ls"
vscode "jasonnutter.vscode-codeowners"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "metalbear.mirrord"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "shopify.ruby-lsp"
vscode "sourcegraph.cody-ai"
vscode "sourcegraph.sourcegraph"
vscode "tsandall.opa"
vscode "unifiedjs.vscode-mdx"
vscode "vadimcn.vscode-lldb"
vscode "william-voyek.vscode-nginx"
vscode "xaver.clang-format"
cargo "cargo-shuttle"
cargo "inlyne"
